{
    "categories": {
        "0": "payment"
    },
    "description": "Juno é um gateway de pagamentos brasileiro que permite realizar cobranças simples e com split.\n\nEsse plugin é para o ambiente Live. Sugiro realizar os testes antes da implantação com o plugin Juno Pagamentos (Sandbox - Testes).\n\nPara usar o Plugin de Integração com a Juno Pagamentos, você precisará:\n\n1) Criar uma conta em sandbox.juno.com.br para testes.\n2) Criar uma conta em juno.com.br para produção.\n3) Credenciais 'clientID' e 'clientSecret'. Solicite pelo email falecom@juno.com.br.\n4) Obter o Token privado em Integrações, no seu painel de controle Juno.\n5) Inserir nas configurações do Plugin no Bubble:\na) Authorization: Basic XXX . Substitua XXX pelo seguinte: acesse https://www.base64encode.org/ , e insira as credenciais 'clientId' e 'clientSecret' obtidas com a Juno, divididas por um ':'. Vamos dizer que seu clientId seja 123, e seu clientSecret seja ABC. Insira 123:456 no campo e clique em > ENCODE <. Irá aparecer um valor no campo de baixo de aprox. 68 dígitos. Copie e cole esse valor no lugar de XXX.\nOBS: Solicite à Juno um Token com permissão de Split, se for realizar pagamentos com split.\nb) Token Público - token público obtido no seu painel de controle Juno.\nc) X-Resource-Token - insira aqui o Token Privado\n\nOBS: Lembre-se que os tokens privados são diferentes para as contas Sandbox e Live.\nNão esqueça de testar todo o fluxo de pagamento primeiro com a conta Sandbox, para depois então recriar na conta Live.\n\nINSTRUÇÕES DE USO PARA PAGAMENTO EM CARTÃO DE CRÉDITO:\n1) Primeiro faça a chamada para criar a cobrança (sem split ou com split)\n2) Gere o Hash do Cartão de crédito que será utlizado para processar o pagamento.\n3) Faça a chamada para processar o pagamento da cobrança.\n4) Pronto. Transação realizada. Verifique no seu Dashboard Juno se a cobrança apareceu para garantir que correu tudo bem.\n\nINSTRUÇÕES DE USO PARA PAGAMENTO EM BOLETO:\n1) Primeiro faça a chamada para gerar o boleto.\n2) Extraia da resposta da chamada o \"embedded charges:first item's checkoutURL\" para pegar o link da tela de pagamento, ou o \"embedded charges:first item's installmentLink\" para pegar o o link direto do boleto em PDF.",
    "image": "//s3.amazonaws.com/appforest_uf/f1581370828195x114486259341483710/logo.jpg",
    "license": "open_source",
    "link": "https://forum.bubble.io/t/plugin-juno-pagamentos-cartao-de-credito-e-boleto/80402",
    "name": "Juno Pagamentos (Live)",
    "plugin_instructions": ""
}